app/controllers/users_controller.rb

UPDATE "users" SET "updated_at" = ?, "github_access_token" = ? WHERE "users"."id" = ?  [["updated_at", "2023-08-13 22:48:32.134817"], ["github_access_token", "[FILTERED]"], ["id", 5]]
---
  def update
    redirect_to @user, notice: "User was successfully updated." if @user.update(user_params).save